app/controllers/ingredients_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @ingredient = Ingredient.find(id) # look up movie by unique ID
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @ingredient = Ingredient.find params[:id]
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @ingredient = Ingredient.find params[:id]
    @ingredient.update_attributes!(ingredient_params)
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "ingredients" SET "quantity" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["quantity", 0], ["updated_at", "2022-10-29 19:46:40.498656"], ["id", 1]]